Repository: JindrichNetusil/EUC
Catalog: EUC/Locales/Resource.*.resx
Languages: cs_cz

# Label_Birthday
source: Birthday
cs_cz: Datum narození

# Button_Send
source: Send
cs_cz: Odeslat

# Label_FirstName
source: First name
cs_cz: Jméno

# Label_GdprAcceptance
source: I agree with GDPR
cs_cz: Souhlasím s GDPR

# Label_HasBirthNumber
source: Don't have birth number
cs_cz: Nemám rodné číslo

# Label_LastName
source: Last name
cs_cz: Příjmení

# Label_Nationality
source: Nationality
cs_cz: Státní příslušnost

# Label_Sex
source: Sex
cs_cz: Pohlaví

# Text_Questionnaire
source: Questionnaire
cs_cz: Dotazník

# Label_BirthNumber
source: Birth number
cs_cz: Rodné číslo

# Label_Birthday_RequiredError
source: Enter birthday
cs_cz: Zadejte datum narození

# Label_BirthNumber_RequiredError
source: Enter birthday
cs_cz: Zadejte rodné číslo

# Label_Email_RequiredError
source: Enter email
cs_cz: Zadejte email

# Label_FirstName_RequiredError
source: Enter first name
cs_cz: Zadejte jméno

# Label_GdprAcceptance_RequiredError
source: To continue, you must agree with GDPR
cs_cz: Pro pokračování musíte souhlasit s GDPR

# Label_LastName_RequiredError
source: Enter last name
cs_cz: Zadejte příjmení

# Label_Nationality_RequiredError
source: Select nationality
cs_cz: Zvolte státní příslušnost

# Label_Sex_RequiredError
source: Select sex
cs_cz: Zvolte pohlaví

# Label_LanguageSelect
source: Select language
cs_cz: Zvolte jazyk

# DropdownItem_Nationality_Czech
source: Czech
cs_cz: Česká

# DropdownItem_Nationality_Slovak
source: Slovak
cs_cz: Slovenská

# DropdownItem_Nationality_Other
source: Other
cs_cz: Ostatní

# DropdownItem_Sex_Man
source: Man
cs_cz: Muž

# DropdownItem_Sex_Woman
source: Woman
cs_cz: Žena

# DropdownItem_Sex_Other
source: Other
cs_cz: Ostatní

# DropdownItem_Language_Czech
source: Czech
cs_cz: Čeština

# DropdownItem_Language_English
source: English
cs_cz: Angličtina

# Validation_BirthNumber_OnlyDigitsOneSlash
source: The birth number can only contain digits and an optional slash
cs_cz: Rodné číslo může obsahovat pouze číslice a volitelné lomítko

# Validation_BirthNumber_SlashPosition
source: If a slash is used, it must be in the seventh position
cs_cz: Pokud je lomítko použito, musí být na sedmé pozici

# Validation_BirthNumber_DigitsCount
source: The birth number must have 9 or 10 digits (possibly with a slash after the sixth digit)
cs_cz: Rodné číslo musí mít 9 nebo 10 číslic (případně s lomítkem po šesté číslici)

# Validation_Email_NoSpaces
source: Email address cannot contain any spaces
cs_cz: Toto pole nemůže obsahovat mezery

# Validation_Email_MissingAt
source: Missing "@" character
cs_cz: Adresa postrádá znak "@"

# Validation_Email_InvalidFormat
source: Invalid email address format
cs_cz: Nesprávný formát emailové adresy

# Validation_Email_EmptyParts
source: Invalid email address format around character "@"
cs_cz: Nesprávný formát emailové adresy kolem znaku "@"

# Validation_Email_InvalidLocalPart
source: Invalid email address format in the part before the "@" character
cs_cz: Nesprávný formát emailové adresy v části před znakem "@"

# Validation_Email_InvalidDomain
source: Incorrect email address format in the part after the "@" sign
cs_cz: Nesprávný formát e mailové adresy v části za znakem "@"

# Button_DownloadGdpr
source: Download GDPR agreement
cs_cz: Stáhnout ujednání o GDPR

# Validation_BirthNumber_DateConversionFailed
source: Date part of birth number is not correct
cs_cz: Datumová část rodného čísla není správná

# Text_Questionnaire_Failed
source: An error occurred while processing the questionnaire.
cs_cz: Při zpracování dotazníku nastala chyba.

# Text_Questionnaire_Success
source: Thank you for sending the questionnaire.
cs_cz: Děkujeme Vám za odeslání dotazníku.

# Text_Questionnaire_DownloadInsertedDataJson
source: Download the inserted data in JSON format
cs_cz: Stáhnout vložená data ve formátu JSON

# Text_Questionnaire_NextQuestionnaire
source: Fill out another questionnaire
cs_cz: Vyplnit další dotazník

# Text_Questionnaire_TryItAgain
source: Try again
cs_cz: Zkusit to znovu

# Text_Loading
source: Loading ...
cs_cz: Načítání dat ...

# Validation_Name_HasInvalidCharacters
source: Name contains invalid characters
cs_cz: Jméno obsahuje nepovolené znaky
